# ShowNewTileDialog

## Description
Displays the new tile dialog.

```pascal
FUNCTION ShowNewTileDialog : HANDLE;
```

```python
def vs.ShowNewTileDialog():
    return HANDLE
```

## Examples
```pascal
tileHandle := ShowNewTileDialog;
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Dialogs - Modern